# -*- encoding : utf-8 -*-
class Bank
  BANKS = {
    # 'BNLNGE22' => 'საქართველოს ეროვნული ბანკი',
    # 'TRESGE22' => 'სახელმწიფო ხაზინა',
    'CBASGE22' => 'ბაზის ბანკი',
    'CNSBGE22' => 'ბანკი კონსტანტა',
    'CRTUGE22' => 'ბანკი ქართუ',
    'DISNGE22' => 'ბითიეი ბანკი',
    'HSBCGE22' => 'ეიჩ ეს ბი სი ბანკი საქართველო',
    'UGEBGE22' => 'ვითიბი ბანკი ჯორჯია',
    'TCZBGE22' => 'ზირაათ ბანკი - საქართველო',
    'TBCBGE22' => 'თიბისი ბანკი',
    'IJSMGE22' => 'ინვესტბანკი',
    'DEVBGE22' => 'კავკასიის განვითარების ბანკი',
    'KSBGGE22' => 'კორ სტანდარტ ბანკი',
    'PRSGGE22' => 'პროგრეს ბანკი',
    'MIBGGE22' => 'პროკრედიტ ბანკი',
    'BAGAGE22' => 'საქართველოს ბანკი',
    'CAVOGE22' => 'ტაოპრივატბანკი',
    'HABGGE22' => 'ხალიკ ბანკ საქართველო',
    'REPLGE22' => 'ბანკი რესპუბლიკა',
    'IBAZGE22' => 'აზერბაიჯანის საერთაშორისო ბანკი - საქართველო',
  }

  def self.bank_name(swift); BANKS[swift] end
end
